from django.shortcuts import render, redirect
from ..models import User, Knowledge

def evolution(request):
	HSK1 = set(["愛", "八", "爸爸", "杯子", "北京", "本", "不客氣", "不", "菜", "茶", "吃", "出租車", "打電話", "大", "的", "點", "電腦", "電視", "電影", "東西", "都", "讀", "對不起", "多", "多少", "兒子", "二", "飯店", "飛機", "分鍾", "高興", "個", "工作", "狗", "漢語", "好", "號", "喝", "和", "很", "後面", "回", "會", "幾", "家", "叫", "今天", "九", "開", "看", "看見", "塊", "來", "老師", "了", "冷", "裏", "六", "嗎", "媽媽", "買", "貓", "沒關系", "沒有", "米飯", "名字", "明天", "哪", "哪兒", "那", "呢", "能", "你", "年", "女兒", "朋友", "漂亮", "蘋果", "七", "前面", "錢", "請", "去", "熱", "人", "認識", "三", "商店", "上", "上午", "少", "誰", "什麽", "十", "時候", "是", "書", "水", "水果", "睡覺", "說", "四", "歲", "他", "她", "太", "天氣", "聽", "同學", "喂", "我", "我們", "五", "喜歡", "下", "下午", "下雨", "先生", "現在", "想", "小", "小姐", "些", "寫", "謝謝", "星期", "學生", "學習", "學校", "一", "一點兒", "醫生", "醫院", "衣服", "椅子", "有", "月", "再見", "在", "怎麽", "怎麽樣", "這", "中國", "中午", "住", "桌子", "字", "昨天", "做", "坐"])
	HSK2 = set(["吧","白","百","幫助","報紙","比","別","賓館","長","唱歌","出","穿","次","從","錯","打籃球","大家","到","得","等","弟弟","第一","懂","對","對","房間","非常","服務員","高","告訴","哥哥","給","公共汽車","公司","貴","過","孩子","還","好吃","黑","紅","火車站","機場","雞蛋","件","教室","姐姐","介紹","近","進","就","覺得","咖啡","開始","考試","可能","可以","課","快","快樂","累","離","兩","零","路","旅遊","賣","慢","忙","每","妹妹","門","面條","男","您","牛奶","女","旁邊","跑步","便宜","票","妻子","起床","千","鉛筆","晴","去年","讓","日","上班","身體","生病","生日","時間","事情","手表","手機","說話","送","雖然…但是…","它","踢足球","題","跳舞","外","完","玩","晚上","往","為什麽","問","問題","希望","西瓜","洗","小時","笑","新","姓","休息","雪","顔色","眼睛","羊肉","藥","要","也","一下","已經","一起","意思","因為…所以…","陰","遊泳","右邊","魚","遠","運動","再","早上","丈夫","找","著","真","正在","知道","准備","走","最","左邊"])
	HSK3 = set(["啊", "阿姨", "矮", "愛好", "安靜", "把", "搬", "班", "辦法", "辦公室", "半", "幫忙", "包", "飽", "北方", "被", "鼻子", "比較", "比賽", "筆記本", "必須", "變化", "別人", "冰箱", "不但…而且…", "菜單", "參加", "草", "層", "差", "超市", "襯衫", "城市", "成績", "遲到", "除了", "船", "春", "詞典", "聰明", "打掃", "打算", "帶", "擔心", "蛋糕", "當然", "地", "燈", "地方", "地鐵", "地圖", "電梯", "電子郵件", "東", "冬", "動物", "短", "段", "鍛煉", "多麽", "餓", "耳朵", "發", "發燒", "發現", "方便", "放", "放心", "分", "複習", "附近", "幹淨", "感冒", "感興趣", "剛才", "個子", "根據", "跟", "更", "公斤", "公園", "故事", "刮風", "關", "關系", "關心", "關于", "國家", "過", "過去", "還是", "害怕", "黑板", "後來", "護照", "花", "花", "畫", "壞", "歡迎", "環境", "還", "換", "黃河", "回答", "會議", "或者", "幾乎", "機會", "極", "季節", "記得", "檢查", "簡單", "健康", "見面", "講", "教", "腳", "角", "接", "街道", "結婚", "結束", "節目", "節日", "解決", "借", "經常", "經過", "經理", "久", "舊", "句子", "決定", "可愛", "渴", "刻", "客人", "空調", "口", "哭", "褲子", "筷子", "藍", "老", "離開", "禮物", "曆史", "臉", "練習", "輛", "聊天", "了解", "鄰居", "留學", "樓", "綠", "馬", "馬上", "滿意", "帽子", "米", "面包", "明白", "拿", "奶奶", "南", "難", "難過", "年級", "年輕", "鳥", "努力", "爬山", "盤子", "胖", "啤酒", "皮鞋", "瓶子", "其實", "其他", "奇怪", "騎", "起飛", "起來", "清楚", "請假", "秋", "裙子", "然後", "熱情", "認為", "認真", "容易", "如果", "傘", "上網", "聲音", "生氣", "世界", "試", "瘦", "叔叔", "舒服", "數學", "樹", "刷牙", "雙", "水平", "司機", "太陽", "特別", "疼", "提高", "體育", "甜", "條", "同事", "同意", "頭發", "突然", "圖書館", "腿", "完成", "碗", "萬", "忘記", "為", "為了", "位", "文化", "西", "習慣", "洗手間", "洗澡", "夏", "先", "相信", "香蕉", "像", "向", "小心", "校長", "新聞", "新鮮", "信用卡", "行李箱", "熊貓", "需要", "選擇", "要求", "爺爺", "一直", "一定", "一共", "一會兒", "一樣", "以前", "一般", "一邊", "音樂", "銀行", "飲料", "應該", "影響", "用", "遊戲", "有名", "又", "遇到", "元", "願意", "月亮", "越", "站", "張", "長", "著急", "照顧", "照片", "照相機", "只", "只", "只有…才…", "中間", "中文", "終于", "種", "重要", "周末", "主要", "注意", "自己", "自行車", "總是", "嘴", "最後", "最近", "作業"])

	if not request.session.get('email'):
		return redirect('login')
	user = User.objects.get(pk=request.session['email'])

	known_words = set([known_word.word.hanzi for known_word in Knowledge.objects.filter(user=user, known=True)])
	HSK1_total = len(HSK1)
	HSK2_total = len(HSK2)
	HSK3_total = len(HSK3)
	records_HSK = [
		[1, HSK1_total - len(HSK1 - known_words), HSK1_total],
		[2, HSK2_total - len(HSK2 - known_words), HSK2_total],
		[3, HSK3_total - len(HSK3 - known_words), HSK3_total]
	]
	
	records_known_unknown = [ record.get_known_unknown() for record in user.history]
	records_lerned_forgotten = [ record.get_learn_forgotten() for record in user.history]
	records_dicov_known_unknown = [ record.get_dicov_known_unknown() for record in user.history]
	return render(request, 'evolution.html', {
		"known_unknown": records_known_unknown,
		"HSK": records_HSK,
		"lerned_forgotten": records_lerned_forgotten,
		"dicov_known_unknown": records_dicov_known_unknown,
	})